In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "name":['arshaq', 'bilal', 'hashir', 'ahmed'],
    "marks":[91, 92, 75, 83],
    "city":['islamabad', 'karachi', 'peshawar', 'multan'],    
}

In [5]:
df = pd.DataFrame(dict1)

In [8]:
df

     name  marks       city
0  arshaq     91  islamabad
1   bilal     92    karachi
2  hashir     75   peshawar
3   ahmed     83     multan